//setTimeout();

/*Якщо встановити 30 сек для завантаження сторінки, і вона не завантажиться за ці 30 сек, 
то можна прийняти рішення виконати якийсь код і перезавантажити сторінку, або показати повідомлення про помилку, або перевиконати запит. 
У нас є затримка, і функція яку ми виконуємо після цієї затримки.

1. Завантажується сторінка
2. Реєструємо Timeout
3. ПІСЛЯ ТОГО, ЯК ПРОЙДЕ ЗАТРИМКА - ЗАПУСКАЄМО ЯКУСЬ ФУНКЦІЮ
*/

function func () {
    console.log(2+2);
}

// func(); //4

setTimeout (func, 2000); // функція виконається не одразу, а через 4 секунди (4000 мілісекунди)


let j = 1;

for (let i = 0; i < 100000000; i++) {
    j *=5;
}

console.log(j);